Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>НДС по ставке  18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>НДС по ставке 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>НДС по ставке 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>Без НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>НДС по ставке 10%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС/Ext/ManagerModule.bsl
&НаСервере
Функция ПолучитьПроцентСтавкиНДС(СтавкаНДС) Экспорт
	ПроцентыНДС = Новый Соответствие;
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18"), 18);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"), 0);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"), 20);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"), 0);
	ПроцентыНДС.Вставить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"), 10);
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат ПроцентыНДС.Получить(СтавкаНДС);
	Иначе
		Возврат 0; 
	КонецЕсли;
КонецФункции
